public class PizzaOrder extends Pizza {
    // Создайте класс PizzaOrder куда можно будет добавлять пиццу  методом add(Pizza)
    // и напишите в этом классе метод calcTotalPrice(): int который вычислит стоимость всех заказанных пицц.
    // add(Pizza);

    // НЕ ПОНИМАЮ ЗАДАНИЕ! (((

    public PizzaOrder(String size, int cheese, int pepperoni, int ham) {
        super(size, cheese, pepperoni, ham);
    }

    PizzaOrder() {
        System.out.println("Constructor PizzaOrder");
    }

    public void add(int Pizza) {

    }

    public int calcTotalPrice() {
//        int TotalPreis =


        return 0;
    }


}
