public class Main {

    public static void main(String[] args) {
        // String s = "skfjskdfsdgshgrghdfasdfqwdfh";.
        //String[] a = {"1,2-4", "3-6", "2,5,7-11", "5"}
        //1. найти индекс J 1
        //2. Отсортировать s use Merge sort 3
        //3. Считает количество повторяющихся символов 3
        //и вывести на экран в таком виде: 3g4s.....
        //4. Integer[] i = {1,2,3,4,3,4,5,6,2,5,7,8,9,10,11,5} 4
        //
        //1. Написать свою реализацию MergeSort
        //2. Отсортировать стрингу use MergeSort
        //3. Почитать MergeSort VS QuickSort
        //4. *Найти индекс какого то символа в строке(без повторов) [ можно псевдокод]
        //5. *String[] a = {"1,2-4", "3-6", "2,5,7-11", "5"} -> Integer[] i = {1,2,3,4,3,4,5,6,2,5,7,8,9,10,11,5}
    }
}
